{
  "week1": {
    "title": "1. Hafta: Temeller",
    "steps": [
      {
        "id": "step_welcome",
        "type": "welcome",
        "title": "Aramıza Hoş Geldin!",
        "content": "Lila Dijital Oryantasyon Programı'na hoş geldin! Bu program, şirket kültürümüzü, değerlerimizi ve takım içindeki potansiyelini anlaman için tasarlandı.\n\nHer adımda sana rehberlik edeceğiz. Hazır olduğunda, 'Anladım, Devam Et' butonuna tıklayarak ilk adıma geçebilirsin."
      },
      {
        "id": "step_values",
        "type": "reading",
        "title": "Değerlerimiz ve Kültürümüz",
        "content": "Bizim için en önemli üç değer şunlardır:\n\n1. **İnovasyon:** Sürekli olarak daha iyi yollar arar, yeni fikirlere her zaman açığız.\n2. **İşbirliği:** En iyi sonuçlara birlikte çalışarak ulaşacağımıza inanırız. Herkesin sesi değerlidir.\n3. **Mükemmellik:** Yaptığımız her işte en yüksek kaliteyi hedefleriz."
      },
      {
        "id": "step_belbin",
        "type": "test",
        "title": "Takım Rolünü Keşfet",
        "content": "Şimdi, takım içinde doğal olarak hangi rollere eğilimli olduğunu keşfetme zamanı. Belbin Takım Rolleri testi, güçlü yönlerini ve takıma nasıl en iyi şekilde katkı sağlayabileceğini anlamana yardımcı olacak.",
        "testId": "belbin"
      }
    ]
  },
  "week2": {
    "title": "2. Hafta: Entegrasyon",
    "steps": [
      {
        "id": "step_social_color",
        "type": "test",
        "title": "İletişim Tarzını Anla",
        "content": "Etkili iletişim, başarılı bir takım çalışmasının temelidir. Sosyal Renk Kişilik Testi, kendi iletişim tarzını ve başkalarıyla nasıl daha etkili bir şekilde etkileşim kurabileceğini anlamanı sağlayacak.",
        "testId": "social_color"
      },
      {
        "id": "step_learning_style",
        "type": "test",
        "title": "Öğrenme Stilini Belirle",
        "content": "Sürekli öğrenme ve gelişim, kültürümüzün bir parçasıdır. Bu son test, en etkili nasıl öğrendiğini (Görsel, İşitsel veya Kinestetik) belirlemene yardımcı olacak.",
        "testId": "learning_style"
      },
       {
        "id": "step_graduation",
        "type": "welcome",
        "title": "Oryantasyonun Tamamlanması",
        "content": "Tebrikler! Oryantasyon programını başarıyla tamamladınız. Artık ekibimizin tam teşekküllü bir üyesisiniz. Başarılarınızın devamını dileriz!"
      }
    ]
  }
}
