{
  "week1": {
    "title": "1. Hafta: Temeller",
    "steps": [
      {
        "id": "step_welcome",
        "type": "welcome",
        "title": "Aramıza Hoş Geldin!",
        "content": "Lila Explorer oryantasyon yolculuğuna hoş geldin! Bu program, şirket kültürümüzü, değerlerimizi ve takım içindeki potansiyelini anlaman için tasarlandı.\n\nHer adımda sana rehberlik edeceğiz. Hazır olduğunda, 'Anladım, Devam Et' butonuna tıklayarak ilk adıma geçebilirsin.",
        "testId": null
      },
      {
        "id": "step_mentor",
        "type": "reading",
        "title": "Mentorunla Tanış",
        "content": "Oryantasyon sürecinde sana destek olacak bir mentor atandı. Mentorun, şirket içi süreçler hakkında sorularını yanıtlayacak ve adaptasyon sürecini kolaylaştıracaktır.\n\nLütfen en kısa zamanda mentorunla bir tanışma toplantısı ayarla. Bu, hem profesyonel ağını kurmana hem de şirket kültürünü daha yakından tanımana yardımcı olacaktır.",
        "testId": null
      },
      {
        "id": "step_values",
        "type": "reading",
        "title": "Değerlerimiz ve Kültürümüz",
        "content": "Bizim için en önemli üç değer şunlardır:\n\n1. **İnovasyon:** Sürekli olarak daha iyi yollar arar, yeni fikirlere her zaman açığız.\n2. **İşbirliği:** En iyi sonuçlara birlikte çalışarak ulaşacağımıza inanırız. Herkesin sesi değerlidir.\n3. **Mükemmellik:** Yaptığımız her işte en yüksek kaliteyi hedefleriz.\n\nBu değerler, günlük kararlarımıza ve birbirimizle olan etkileşimlerimize yön verir. Lütfen bu prensipleri benimsemeye özen göster.",
        "testId": null
      },
      {
        "id": "step_belbin",
        "type": "test",
        "title": "Takım Rolünü Keşfet",
        "content": "Şimdi, takım içinde doğal olarak hangi rollere eğilimli olduğunu keşfetme zamanı. Belbin Takım Rolleri testi, güçlü yönlerini ve takıma nasıl en iyi şekilde katkı sağlayabileceğini anlamana yardımcı olacak.\n\nBu test yaklaşık 12-15 dakika sürecektir. Lütfen dikkatlice ve dürüstçe cevap ver.",
        "testId": "belbin"
      },
      {
        "id": "step_checkin1",
        "type": "reading",
        "title": "İlk Hafta Değerlendirmesi",
        "content": "Tebrikler, ilk haftanın önemli bir bölümünü tamamladın! Bu hafta öğrendiklerini ve deneyimlerini düşünmek için biraz zaman ayır. Aklına takılan soruları not al ve mentorunla veya yöneticinle paylaşmaktan çekinme.\n\nİkinci haftada daha derin konulara dalacağız. Hazır olduğunda bir sonraki adıma geçebilirsin.",
        "testId": null
      }
    ]
  },
  "week2": {
    "title": "2. Hafta: Entegrasyon",
    "steps": [
      {
        "id": "step_social_color",
        "type": "test",
        "title": "İletişim Tarzını Anla",
        "content": "Etkili iletişim, başarılı bir takım çalışmasının temelidir. Sosyal Renk Kişilik Testi, kendi iletişim tarzını ve başkalarıyla nasıl daha etkili bir şekilde etkileşim kurabileceğini anlamanı sağlayacak.\n\nBu test yaklaşık 8-10 dakika sürecektir.",
        "testId": "social_color"
      },
      {
        "id": "step_learning_style",
        "type": "test",
        "title": "Öğrenme Stilini Belirle",
        "content": "Sürekli öğrenme ve gelişim, kültürümüzün bir parçasıdır. Bu son test, en etkili nasıl öğrendiğini (Görsel, İşitsel veya Kinestetik) belirlemene yardımcı olacak. Bu bilgi, profesyonel gelişimini en üst düzeye çıkarmana olanak tanıyacak.\n\nBu test yaklaşık 5-7 dakika sürecektir.",
        "testId": "learning_style"
      }
    ]
  },
   "week3": {
    "title": "3. Hafta: Derinlemesine Bakış ve İşbirliği",
    "steps": [
      {
        "id": "step_project_dive",
        "type": "reading",
        "title": "Projelere Derinlemesine Bakış",
        "content": "İlk projenize dalma zamanı! Projenin hedeflerini, kapsamını ve bu projedeki özel rolünüzü anlamak için proje dokümanlarını inceleyin. Yöneticinizle bir toplantı ayarlayarak beklentileri netleştirin.",
        "testId": null
      },
      {
        "id": "step_cross_functional",
        "type": "reading",
        "title": "Departmanlar Arası Tanışma",
        "content": "Şirketimizin bütünsel işleyişini anlamak, başarının anahtarlarından biridir. Bu hafta, farklı bir departmandan (örneğin Pazarlama, Satış, Destek) bir meslektaşınızla sanal bir kahve molası planlayın. Onların ne yaptığını ve rollerimizin nasıl kesiştiğini öğrenin.",
        "testId": null
      },
      {
        "id": "step_feedback_culture",
        "type": "reading",
        "title": "Geri Bildirim Kültürümüz",
        "content": "Sürekli gelişim için açık ve yapıcı geri bildirime inanıyoruz. Lütfen mentorunuzdan veya yöneticinizden ilk haftalarınızla ilgili geri bildirim isteyin. Aynı şekilde, süreçlerimiz hakkında gözlemlerinizi ve fikirlerinizi paylaşmaktan çekinmeyin.",
        "testId": null
      }
    ]
  },
  "week4": {
    "title": "4. Hafta: Büyüme ve Gelecek",
    "steps": [
       {
        "id": "step_career_path",
        "type": "reading",
        "title": "Kariyer Yolculuğun",
        "content": "Lila'da kariyer gelişimini destekliyoruz. Şirket içi kariyer yolları, eğitim fırsatları ve gelişim programları hakkında bilgi edinin. Uzun vadeli hedeflerinizi düşünmeye başlayın ve bunları yöneticinizle paylaşın.",
        "testId": null
      },
      {
        "id": "step_first_month_review",
        "type": "reading",
        "title": "İlk Ay Değerlendirmesi",
        "content": "İlk ayınızı tamamlamak üzeresiniz! Yöneticinizle bir 'İlk Ay Değerlendirmesi' toplantısı planlayın. Bu toplantıda ilk ayki performansınızı, öğrendiklerinizi ve gelecek için hedeflerinizi konuşacaksınız.",
        "testId": null
      },
      {
        "id": "step_graduation",
        "type": "welcome",
        "title": "Oryantasyonun Tamamlanması",
        "content": "Tebrikler! Dört haftalık oryantasyon programını başarıyla tamamladınız. Artık ekibimizin tam teşekküllü bir üyesisiniz. Bu yolculukta gösterdiğiniz çaba için teşekkür ederiz. Başarılarınızın devamını dileriz!",
        "testId": null
      }
    ]
  }
}